Revit 2026 API

# EnergyDataSettingsUseOutsideAirPerArea Property

---

True is user is specifying outside air per area, false otherwise.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool UseOutsideAirPerArea { get; set; }
```
```vb
Public Property UseOutsideAirPerArea As Boolean
	Get
	Set
```
```cpp
public:
property bool UseOutsideAirPerArea {
	bool get ();
	void set (bool value);
}
```
```fsharp
member UseOutsideAirPerArea : bool with get, set
```

#### Property Value

Boolean

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace